src/python/decorator.org
#+TITLE: Python装饰器
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+OPTIONS: num:nil timestamp:nil ^:nil *:nil
想理解Python的装饰器，首先要知道在Python中函数也是一个对象，所以可以：
+ 将函数赋值给变量
+ 将函数当做参数
+ 返回一个函数
  
* 引子
  如果想在login函数中输出调试信息，可以这样做：
  #+BEGIN_SRC python
    #!/usr/bin/python
    # -*- coding:utf-8 -*-  
    #Filename: print_debug.py

    def login():
        print('in login')
        
    def printdebug(func):
        print('enter the login')
        func()
        print('exit the login')
        
    printdebug(login)
  #+END_SRC
  测试结果：
  #+BEGIN_SRC
   enter the login
   in login
   exit the login
  #+END_SRC
  缺点就是每次调用login都通过printdebug来调用
  
* 函数式调用
  既然函数可以作为返回值，可以赋值给变量，那让代码优美一点：
  #+BEGIN_SRC python
    #!/usr/bin/python
    # -*- coding:utf-8 -*-  
    #Filename: print_debug_with_function.py

    def login():
        print('in login')
        
    def printdebug(func): #func函数作为参数传入
        def __decorator():
            print('enter the login')
            func()
            print('exit the login')
        return __decorator  #函数作为返回值

    debug_login = printdebug(login)  #将函数赋值给变量

    debug_login()  #通过变量来调用的函数
  #+END_SRC
  这样每次只要调用debug_login就可以了。将原先的两个函数printdebug和login绑定到一起，成为debug_login。这种耦合叫内聚
  
* 语法糖
  printdebug和login是通过
  #+BEGIN_SRC python
  debug_login = printdebug(login)
  #+END_SRC
  来结合的，但这似乎也是多余的，我们希望在定义login上加个标注，从而将printdebug和login结合起来。Python的解决方案是提供一个语法糖，用一个@符号来结合它们：
  #+BEGIN_SRC python
  def printdebug(func):
      def __decorator():
          print('enter the login')
          func()
          print('exit the login')
      return __decorator  

  @printdebug  #把login做为func的实际参数传入printdebug的
  def login():
      print('in login')
      
  login()  #使得调用更加自然, 实际上是在调用printdebug(login)()
  #+END_SRC
  __decorator函数就是一个：使用函数作参数并且返回函数的函数。这样改进的好处是：
+ 更简短的代码，将结合点放在函数定义时
+ 不改变原函数的函数名
  
事实上在Python解释器发现login调用时，会将login转换为：
#+BEGIN_SRC python
  printdebug(login)()

  __decorator ()
#+END_SRC
也就是说真正执行的是__decorator(把func绑定成实参login函数)这个函数

* 加上参数
  
** login函数有参数
   login函数可能有参数，比如login的时候传人user的信息。也就是说，要这样调用login：
   #+BEGIN_SRC python
login(user)
   #+END_SRC
   Python会将login的参数直接传给__decorator这个函数。因此可以直接在__decorator中使用user变量：
   #+BEGIN_SRC python
     #!/usr/bin/python
     # -*- coding:utf-8 -*-  
     #Filename: login_with_param_decorator.py
     def printdebug(func):
         def __decorator(user):    # 增加传递给login的参数
             print('enter the login')
             func(user)  # login调用带上参数
             print('exit the login')
         return __decorator  

     @printdebug 
     def login(user):
         print('in login:' + user)
         
     login('jatsz')  # 真实调用是__decorator('jatsz') 
   #+END_SRC
   
   测试结果:
   #+BEGIN_SRC
enter the login
in login:jatsz
exit the login
   #+END_SRC
   
   事实上的调用过程是：
   #+BEGIN_SRC python
  login('jatsz')

  printdebug(login)('jatsz')

  __decorator('jatsz') 
   #+END_SRC
   
