html/python/decorator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python装饰器</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">Python装饰器</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge441c06">引子</a></li>
<li><a href="#orgbd55110">函数式调用</a></li>
<li><a href="#orgd7066a4">语法糖</a></li>
<li><a href="#orgca997ac">加上参数</a>
<ul>
<li><a href="#org2824b7a">login函数有参数</a></li>
<li><a href="#org925b052">装饰器本身有参数</a></li>
</ul>
</li>
<li><a href="#org61d5144">装饰有返回值的函数</a></li>
<li><a href="#org738864c">多个装饰器</a></li>
<li><a href="#orgf4b4d84">灵活运用</a></li>
</ul>
</div>
</div>
<p>
想理解Python的装饰器，首先要知道在Python中函数也是一个对象，所以可以：
</p>
<ul class="org-ul">
<li>将函数赋值给变量</li>
<li>将函数当做参数</li>
<li>返回一个函数</li>
</ul>

<div id="outline-container-orge441c06" class="outline-2">
<h2 id="orge441c06">引子</h2>
<div class="outline-text-2" id="text-orge441c06">
<p>
如果想在login函数中输出调试信息，可以这样做：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">!/usr/bin/python</span>
<span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">-*- coding:utf-8 -*-  </span>
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">Filename: print_debug.py</span>

<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">login</span>():
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'in login'</span>)

<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">printdebug</span>(func):
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'enter the login'</span>)
<span style="background-color: #405060;"> </span>   func()
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'exit the login'</span>)

printdebug(login)
</pre>
</div>
<p>
测试结果：
</p>
<pre class="example">
enter the login
in login
exit the login
</pre>
<p>
缺点就是每次调用login都通过printdebug来调用
</p>
</div>
</div>

<div id="outline-container-orgbd55110" class="outline-2">
<h2 id="orgbd55110">函数式调用</h2>
<div class="outline-text-2" id="text-orgbd55110">
<p>
既然函数可以作为返回值，可以赋值给变量，那让代码优美一点：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">!/usr/bin/python</span>
<span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">-*- coding:utf-8 -*-  </span>
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">Filename: print_debug_with_function.py</span>

<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">login</span>():
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'in login'</span>)

<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">printdebug</span>(func): <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">func&#20989;&#25968;&#20316;&#20026;&#21442;&#25968;&#20256;&#20837;</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">__decorator</span>():
        <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'enter the login'</span>)
        func()
        <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'exit the login'</span>)
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">return</span> __decorator  <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#20989;&#25968;&#20316;&#20026;&#36820;&#22238;&#20540;</span>

<span style="color: #4eee94;">debug_login</span> = printdebug(login)  <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#23558;&#20989;&#25968;&#36171;&#20540;&#32473;&#21464;&#37327;</span>

debug_login()  <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#36890;&#36807;&#21464;&#37327;&#26469;&#35843;&#29992;&#30340;&#20989;&#25968;</span>
</pre>
</div>
<p>
这样每次只要调用debug_login就可以了。将原先的两个函数printdebug和login绑定到一起，成为debug_login。这种耦合叫内聚
</p>
</div>
</div>

<div id="outline-container-orgd7066a4" class="outline-2">
<h2 id="orgd7066a4">语法糖</h2>
<div class="outline-text-2" id="text-orgd7066a4">
<p>
printdebug和login是通过
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4eee94;">debug_login</span> = printdebug(login)
</pre>
</div>
<p>
来结合的，但这似乎也是多余的，我们希望在定义login上加个标注，从而将printdebug和login结合起来。Python的解决方案是提供一个语法糖，用一个@符号来结合它们：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">printdebug</span>(func):
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">__decorator</span>():
        <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'enter the login'</span>)
        func()
        <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'exit the login'</span>)
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">return</span> __decorator  

<span style="color: #98f5ff;">@printdebug</span>  <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#25226;login&#20570;&#20026;func&#30340;&#23454;&#38469;&#21442;&#25968;&#20256;&#20837;printdebug&#30340;</span>
<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">login</span>():
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'in login'</span>)

login()  <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#20351;&#24471;&#35843;&#29992;&#26356;&#21152;&#33258;&#28982;, &#23454;&#38469;&#19978;&#26159;&#22312;&#35843;&#29992;printdebug(login)()</span>
</pre>
</div>
<p>
__decorator函数就是一个：使用函数作参数并且返回函数的函数。这样改进的好处是：
</p>
<ul class="org-ul">
<li>更简短的代码，将结合点放在函数定义时</li>
<li>不改变原函数的函数名</li>
</ul>

<p>
事实上在Python解释器发现login调用时，会将login转换为：
</p>
<div class="org-src-container">
<pre class="src src-python">printdebug(login)()

__decorator ()
</pre>
</div>
<p>
也就是说真正执行的是__decorator(把func绑定成实参login函数)这个函数
</p>
</div>
</div>

<div id="outline-container-orgca997ac" class="outline-2">
<h2 id="orgca997ac">加上参数</h2>
<div class="outline-text-2" id="text-orgca997ac">
</div>
<div id="outline-container-org2824b7a" class="outline-3">
<h3 id="org2824b7a">login函数有参数</h3>
<div class="outline-text-3" id="text-org2824b7a">
<p>
login函数可能有参数，比如login的时候传人user的信息。也就是说，要这样调用login：
</p>
<div class="org-src-container">
<pre class="src src-python">login(user)
</pre>
</div>
<p>
Python会将login的参数直接传给__decorator这个函数。因此可以直接在__decorator中使用user变量：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">!/usr/bin/python</span>
<span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">-*- coding:utf-8 -*-  </span>
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">Filename: login_with_param_decorator.py</span>
<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">printdebug</span>(func):
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">__decorator</span>(user):    <span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">&#22686;&#21152;&#20256;&#36882;&#32473;login&#30340;&#21442;&#25968;</span>
        <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'enter the login'</span>)
        func(user)  <span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">login&#35843;&#29992;&#24102;&#19978;&#21442;&#25968;</span>
        <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'exit the login'</span>)
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">return</span> __decorator  

<span style="color: #98f5ff;">@printdebug</span> 
<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">login</span>(user):
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'in login:'</span> + user)

login(<span style="color: #deb887;">'jatsz'</span>)  <span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">&#30495;&#23454;&#35843;&#29992;&#26159;__decorator('jatsz') </span>
</pre>
</div>

<p>
测试结果:
</p>
<pre class="example">
enter the login
in login:jatsz
exit the login
</pre>

<p>
事实上的调用过程是：
</p>
<div class="org-src-container">
<pre class="src src-python">login(<span style="color: #deb887;">'jatsz'</span>)

printdebug(login)(<span style="color: #deb887;">'jatsz'</span>)

__decorator(<span style="color: #deb887;">'jatsz'</span>) 
</pre>
</div>
</div>
</div>
