src/python/decorator.org
** 装饰器本身有参数
   在定义decorator时，也可以带入参数，比如这样使用decorator，传入一个参数来指定debug level
   #+BEGIN_SRC python
  #!/usr/bin/python
  # -*- coding:utf-8 -*-  
  #Filename: decorator_with_param.py

  def printdebug_level(level):  #通过wrapper来增加装饰器的参数
      def printdebug(func):
          def __decorator(user):    
              print('enter the login, and debug level is: ' + str(level)) #打印debug等级
              func(user)  
              print('exit the login')
          return __decorator  
      return printdebug    #返回原始的装饰器

  @printdebug_level(level=5)   #传入装饰器的debug等级参数为5
  def login(user):
      print('in login:' + user)
      
  login('jatsz') #等价于printdebug_level(5) (login) ('jatsz') 
   #+END_SRC
   测试结果：
   #+BEGIN_SRC
     enter the login, and debug level is: 5
     in login:jatsz
     exit the login
   #+END_SRC
   此时的pringdebug函数相当于pringdebug_level(5) 
   
* 装饰有返回值的函数
  有时候login会有返回值，比如返回message来表明login是否成功：
  #+BEGIN_SRC python
  login_result = login(‘jatsz’)
  #+END_SRC
  
  这时候需要将返回值在decorator和调用函数间传递：
  #+BEGIN_SRC python
  #!/usr/bin/python
  # -*- coding:utf-8 -*-  
  #Filename: decorator_return_result.py

  def printdebug(func):
      def __decorator(user):    
          print('enter the login')
          result = func(user)  
          print('exit the login')
          return result        #在装饰器函数返回调用func的结果
      return __decorator  
   
  @printdebug 
  def login(user):
      print('in login:' + user)
      msg = "success" if user == "jatsz" else "fail"
      return msg  # login函数返回结果
   
  result1 = login('jatsz')
  print(result1) #success 
   
  result2 = login('candy')
  print (result2) #fail
  #+END_SRC
  测试结果：
  #+BEGIN_SRC
enter the login
in login:jatsz
exit the login
success

enter the login
in login:candy
exit the login
fail
  #+END_SRC
  
* 多个装饰器
  可以对一个函数应用多个装饰器，这时需要留心的是应用装饰器的顺序对结果会产生影响。例如：
  #+BEGIN_SRC python
    #!/usr/bin/python
    # -*- coding:utf-8 -*-  
    #Filename: multiple_decorators.py

    def printdebug(func):
        def __decorator():    
            print('enter the login')
            func() 
            print('exit the login')
        return __decorator  

    def others(func):    
        def __decorator():
            print ('***other decorator***')
            func()
        return __decorator

    @others         #相当于others(printdebug(login)) ()
    @printdebug
    def login():
        print('in login:')
        
    @printdebug    #相当于printdebug(others(login)) ()
    @others
    def logout():
        print('in logout:')
        
    login()
    print('---------------------------') 
    logout()
  #+END_SRC
  测试结果：
  #+BEGIN_SRC
  ***other decorator***
  enter the login
  in login:
  exit the login
  ---------------------------
  enter the login
  ***other decorator***
  in logout:
  exit the login
  #+END_SRC
  login和logout输出截然相同。造成这个输出不同的原因是应用装饰器的顺序不同。回头看看login的定义，是先应用others，然后才是printdebug。而logout函数正好相反，在逻辑上可以将logout函数应用装饰器的过程这样看：
  #+BEGIN_SRC python
  @printdebug    
  (
      @others
      (
          def logout():
              print('in logout:')
      )
  )
  #+END_SRC
  
