html/python/decorator.html

<div id="outline-container-org925b052" class="outline-3">
<h3 id="org925b052">装饰器本身有参数</h3>
<div class="outline-text-3" id="text-org925b052">
<p>
在定义decorator时，也可以带入参数，比如这样使用decorator，传入一个参数来指定debug level
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">!/usr/bin/python</span>
<span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">-*- coding:utf-8 -*-  </span>
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">Filename: decorator_with_param.py</span>

<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">printdebug_level</span>(level):  <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#36890;&#36807;wrapper&#26469;&#22686;&#21152;&#35013;&#39280;&#22120;&#30340;&#21442;&#25968;</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">printdebug</span>(func):
        <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">__decorator</span>(user):    
            <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'enter the login, and debug level is: '</span> + <span style="color: #f08080;">str</span>(level)) <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#25171;&#21360;debug&#31561;&#32423;</span>
            func(user)  
            <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'exit the login'</span>)
        <span style="color: #00bfff; font-weight: bold;">return</span> __decorator  
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">return</span> printdebug    <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#36820;&#22238;&#21407;&#22987;&#30340;&#35013;&#39280;&#22120;</span>

<span style="color: #98f5ff;">@printdebug_level</span>(level=5)   <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#20256;&#20837;&#35013;&#39280;&#22120;&#30340;debug&#31561;&#32423;&#21442;&#25968;&#20026;5</span>
<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">login</span>(user):
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'in login:'</span> + user)

login(<span style="color: #deb887;">'jatsz'</span>) <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#31561;&#20215;&#20110;printdebug_level(5) (login) ('jatsz') </span>
</pre>
</div>
<p>
测试结果：
</p>
<pre class="example">
enter the login, and debug level is: 5
in login:jatsz
exit the login
</pre>
<p>
此时的pringdebug函数相当于pringdebug_level(5) 
</p>
</div>
</div>
</div>

<div id="outline-container-org61d5144" class="outline-2">
<h2 id="org61d5144">装饰有返回值的函数</h2>
<div class="outline-text-2" id="text-org61d5144">
<p>
有时候login会有返回值，比如返回message来表明login是否成功：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4eee94;">login_result</span> = login(&#8216;jatsz&#8217;)
</pre>
</div>

<p>
这时候需要将返回值在decorator和调用函数间传递：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">!/usr/bin/python</span>
<span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">-*- coding:utf-8 -*-  </span>
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">Filename: decorator_return_result.py</span>

<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">printdebug</span>(func):
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">__decorator</span>(user):    
        <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'enter the login'</span>)
        <span style="color: #4eee94;">result</span> = func(user)  
        <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'exit the login'</span>)
        <span style="color: #00bfff; font-weight: bold;">return</span> result        <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#22312;&#35013;&#39280;&#22120;&#20989;&#25968;&#36820;&#22238;&#35843;&#29992;func&#30340;&#32467;&#26524;</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">return</span> __decorator  

<span style="color: #98f5ff;">@printdebug</span> 
<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">login</span>(user):
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'in login:'</span> + user)
<span style="background-color: #405060;"> </span>   <span style="color: #4eee94;">msg</span> = <span style="color: #deb887;">"success"</span> <span style="color: #00bfff; font-weight: bold;">if</span> user == <span style="color: #deb887;">"jatsz"</span> <span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #deb887;">"fail"</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">return</span> msg  <span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">login&#20989;&#25968;&#36820;&#22238;&#32467;&#26524;</span>

<span style="color: #4eee94;">result1</span> = login(<span style="color: #deb887;">'jatsz'</span>)
<span style="color: #00bfff; font-weight: bold;">print</span>(result1) <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">success </span>

<span style="color: #4eee94;">result2</span> = login(<span style="color: #deb887;">'candy'</span>)
<span style="color: #00bfff; font-weight: bold;">print</span> (result2) <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">fail</span>
</pre>
</div>
<p>
测试结果：
</p>
<pre class="example">
enter the login
in login:jatsz
exit the login
success

enter the login
in login:candy
exit the login
fail
</pre>
</div>
</div>

<div id="outline-container-org738864c" class="outline-2">
<h2 id="org738864c">多个装饰器</h2>
<div class="outline-text-2" id="text-org738864c">
<p>
可以对一个函数应用多个装饰器，这时需要留心的是应用装饰器的顺序对结果会产生影响。例如：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">!/usr/bin/python</span>
<span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">-*- coding:utf-8 -*-  </span>
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">Filename: multiple_decorators.py</span>

<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">printdebug</span>(func):
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">__decorator</span>():    
        <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'enter the login'</span>)
        func() 
        <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'exit the login'</span>)
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">return</span> __decorator  

<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">others</span>(func):    
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">__decorator</span>():
        <span style="color: #00bfff; font-weight: bold;">print</span> (<span style="color: #deb887;">'***other decorator***'</span>)
        func()
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">return</span> __decorator

<span style="color: #98f5ff;">@others</span>         <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#30456;&#24403;&#20110;others(printdebug(login)) ()</span>
<span style="color: #98f5ff;">@printdebug</span>
<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">login</span>():
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'in login:'</span>)

<span style="color: #98f5ff;">@printdebug</span>    <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#30456;&#24403;&#20110;printdebug(others(login)) ()</span>
<span style="color: #98f5ff;">@others</span>
<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">logout</span>():
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'in logout:'</span>)

login()
<span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'---------------------------'</span>) 
logout()
</pre>
</div>
<p>
测试结果：
</p>
<pre class="example">
***other decorator***
enter the login
in login:
exit the login
---------------------------
enter the login
***other decorator***
in logout:
exit the login
</pre>
<p>
login和logout输出截然相同。造成这个输出不同的原因是应用装饰器的顺序不同。回头看看login的定义，是先应用others，然后才是printdebug。而logout函数正好相反，在逻辑上可以将logout函数应用装饰器的过程这样看：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #98f5ff;">@printdebug</span>    
(
<span style="background-color: #405060;"> </span>   <span style="color: #98f5ff;">@others</span>
<span style="background-color: #405060;"> </span>   (
        <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">logout</span>():
            <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #deb887;">'in logout:'</span>)
<span style="background-color: #405060;"> </span>   )
)
</pre>
</div>
</div>
</div>
